Tutorials-2.2.0/mixingChanngel-1-Central/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

eeps	1e-4;

componentsNames
(
    N
    H2
);

inertPhaseIndex 1;

/*
 *
 * Phase 1 (Sn) properties
 *
 */
N
{
    Cp
    {
	dimensions [ 0 2 -2 -1 0 0 0 ];
	type		constant;
	value		1040;
    }
    mu
    {
	dimensions [ 1 0 0 0 -1 0 0 ];
	type		constant;
	value		28e-3;
    }
    Pr
    {
	dimensions [ 0 0 0 0 0 0 0 ];
	type		constant;
	value		0.7;
    }
    eta
    {
	dimensions [1 -1 -1 0 0 0 0];
	type		constant;
	value		1.7e-5;
    }
    lambda
    {
	dimensions [ 1 1 -3 -1 0 0 0 ];
	type		constant;
	value		2.73e-2;
    }
    D
    {
	dimensions [ 0 2 -1 0 0 0 0 ];
	type		constant;
	value		0.0;
    }
};

/*
 *
 * Phase 2 (H2) properties
 *
 */
H2
{
    mu
    {
	dimensions [ 1 0 0 0 -1 0 0 ];
	type		constant;
	value		2.0e-3;
    }
    Cp
    {
	dimensions [ 0 2 -2 -1 0 0 0 ];
	//type		table;
	//outOfBounds	error;
	//fileName	"${FOAM_CASE}/constant/H2Cp";
	type		constant;
	value		15000;
    }
    Pr
    {
	dimensions [ 0 0 0 0 0 0 0 ];
	type		constant;
	value		0.73;
    }
    eta
    {
	dimensions [1 -1 -1 0 0 0 0];
	//type		table;
	//outOfBounds	error;
	//fileName	"${FOAM_CASE}/constant/H2eta";
	type		constant;
	value		8.9e-6;
    }
    lambda
    {
	dimensions [ 1 1 -3 -1 0 0 0 ];
	type		constant;
	value		0.0;
    }
    D
    {
	dimensions [ 0 2 -1 0 0 0 0 ];
	type		constant;
	value		0.0;
    }
}

mixturePropertyCalculator constScPrHerningZipperePropertyCalculator;

constScPrHerningZipperePropertyCalculatorCoeffs
{
    Pr	Pr [0 0 0 0 0 0 0] 1.0;
    Sc	Sc [0 0 0 0 0 0 0] 1.0;
    etaSmall etaSmall [1 -1 -1 0 0 0 0] 1e-8;
}

Prt	Prt [0 0 0 0 0 0 0] 1.0;
Sct	Sct [0 0 0 0 0 0 0] 1.0;


// ************************************************************************* //
